{
   "fullstack":{
      "title":"Full Stack",
      "synonym":[
         "fullstack",
         "full stack Dev",
         "full stack developer"
      ],
      "en":"A person who can develop both client and server software.",
      "fa":"فردی که توانایی تولید نرم افزار در هر دو سمت کلاینت و سرور را دارا باشد.",
      "link":[
         "https:\/\/www.quora.com\/What-does-the-term-full-stack-programmer-mean-What-are-the-defining-traits-of-a-full-stack-programmer",
         "https:\/\/www.webopedia.com\/TERM\/F\/full-stack.html"
      ],
      "date":"2020-02-16 12:53:37 AM"
   },
   "developer":{
      "title":"Developer",
      "synonym":[
         "developer"
      ],
      "en":"A developer is an individual that builds and create software and applications. He or she writes, debugs and executes the source code of a software application. ",
      "fa":"فردی که خالق نرم افزار و اپلیکیشن می باشد، نوشتن برنامه، عیب یابی و اجرای کدها از اقداماتی است که توسط اون انجام می شود. عموما افراد دست اندرکار توسعه نرم افزار، وب سایت و اپلیکیشن را می نامند.",
      "link":[
         "https:\/\/www.techopedia.com\/definition\/17095\/developer",
         "https:\/\/en.wikipedia.org\/wiki\/Developer"
      ],
      "date":"2020-02-16 12:53:37 AM"
   },
   "UI":{
      "title":"UI",
      "synonym":[
         "user interface"
      ],
      "en":"The user interface, in the industrial design field of human-computer interaction, is the space where interactions between humans and machines occur.",
      "fa":"فضایی است که تعامل بین انسان و ماشین در آن رخ می دهد. واسط کاربری، بخش دیدنی و قابل لمس یک ابزار است که کاربر مستقیما با آن سر و کار دارد. این اصطلاح را میانجی کاربری و رابط کاربری هم ترجمه کرده اند. هر رابط به دو ساز و کار اساسی مجهز است: درون داد کاربر از طریق رابط کاربر ، به ماشین فرمان می دهد برون داد ماشین از دریچه رابط کاربر به دستور های کارر، پاسخ و عکس العمل نشان می دهد. در این حالت اصطلاحا می گویند که کاربر و رابط کاربر، بایکدیگر تعامل دارند.",
      "link":[
         "https:\/\/www.techopedia.com\/definition\/17095\/developer",
         "https:\/\/en.wikipedia.org\/wiki\/Developer"
      ],
      "date":"2020-02-16 12:53:37 AM"
   },
     "client":{
      "title":"Client",
      "synonym":[
         "device",
		 "side",
		 "server"
      ],
      "en":"A client is a piece of computer hardware or software that accesses a service made available by a server. ",
      "fa":"سرویس گیرنده (کلاینت) می تواند بخشی از سخت افزار یا نرم افزار کامپیوتر باشد که در حال استفاده از خدمات ارائه شده توسط سرویس دهنده (سرور) می باشد. به طور مثال مرورگر وب یک نرم افزار کلاینت برای وب سرور ها می باشد یا دستگاه کارت خوان یک سخت افزار کلاینت برای سرور بانک می باشد.",
      "link":[
         "https://en.wikipedia.org/wiki/Client_(computing)",
         "https://www.computerhope.com/jargon/c/client.htm"
      ],
      "date":"2020-02-20 12:53:37 AM"
   },
   "server":{
      "title":"Server",
      "synonym":[
				 "device",
				 "side",
				 "client"
				],
      "en":"In computing, a server is a computer program or a device that provides functionality for other programs or devices, called (clients).",
      "fa":".سرویس دهنده (سرور) قسمتی از سخت افزار یا نرم افزار کامپیوتر می باشد که با اجرای برنامه ها و توابع خدماتی را به سرویس گیرنده (کلاینت) ارائه می کند.",
      "link": [
				"https://en.wikipedia.org/wiki/Server_(computing)",
				"https://www.computerhope.com/jargon/s/server.htm"
			  ],
      "date":"2020-02-20 12:53:37 AM"
   },
   "software":{
      "title":"Software",
      "synonym":[
				 "app",
				 "application",
				 "platform",
				 "program"
			    ],
      "en":"Computer software, or simply software, is a collection of data or computer instructions that tell the computer how to work.",
      "fa":"مجموعه ای از داده ها یا دستورالعمل های کامپیوتری است که به کامپیوتر می گوید  چگونه کار کند",
      "link":[
				"https://en.wikipedia.org/wiki/Software",
				"https://www.computerhope.com/jargon/s/software.htm"
             ],
      "date":"2020-02-20 12:53:37 AM"
   },
   "html":{
      "title":"Html",
      "synonym":[
				 "language",
				 "programming",
				 "developers"
			    ],
      "en":"Hypertext Markup Language is the standard markup language for documents designed to be displayed in a web browser.",
      "fa":"یک زبان علامت گذاری استاندارد برای اسنادی است که برای نمایش در یک مرورگر وب طراحی شده است",
      "link":[
				"https://en.wikipedia.org/wiki/HTML",
				"https://www.computerhope.com/jargon/h/html.htm"
             ],
      "date":"2020-02-20 12:53:37 AM"
   },
   "database":{
      "title":"Database",
      "synonym":[
				 "databank",
				 "datastore",
				 "db"
			    ],
      "en":"A database is an organized collection of data, generally stored and accessed electronically from a computer system.",
      "fa":"ایگاه داده ها مجموعه ای متشکل از داده ها است که عموماً بصورت الکترونیکی از یک سیستم کامپیوتری ذخیره و قابل دسترسی می باشد.",
      "link":[
				"https://en.wikipedia.org/wiki/Database",
				"https://www.computerhope.com/jargon/d/database.htm"
             ],
      "date":"2020-02-20 12:53:37 AM"
   },
   "front-end":{
      "title":"Front end",
      "synonym":[
				 "interface",
				 "f/e",
				 "view",
				 "client-side",
				 "back-end"
			    ],
      "en":"Front-end web development is the practice of converting data to a graphical interface, through the use of HTML, CSS, and JavaScript, so that users can view and interact with that data.",
      "fa":"طراحی یا کدنویسی هر آن چیزی که مربوط به جلوی وبسایت میشود. در واقع یک طراح وب یا یک Front End Developer، کسی است که چیزی را طراحی میکند کاربر آنرا میبیند.",
      "link":[
				"https://en.wikipedia.org/wiki/Front-end_web_development",
				"https://www.computerhope.com/jargon/f/frontend.htm"
             ],
      "date":"2020-02-20 12:53:37 AM"
   },
   "back-end":{
      "title":"Back end",
      "synonym":[
				 "server-side",
				 "b/e"
			    ],
      "en":"The back-end, or the (server-side), is basically how the site works, updates, and changes. This refers to everything the user can't see in the browser, like databases and servers.",
      "fa":"بک گراند یا (سمت سرور) اساساً نحوه کار ، به روزرسانی و تغییر سایت است. این به همه چیزهایی که کاربر نمی تواند در مرورگر ، مانند بانکهای اطلاعاتی و سرورها ، ببیند ، اطلاق می شود.",
      "link":[
				"https://en.wikipedia.org/wiki/Front_and_back_ends",
				"https://www.computerhope.com/jargon/b/backend.htm"
             ],
      "date":"2020-02-20 12:53:37 AM"
   },
   "css":{
      "title":"Css",
      "synonym":[
				 "language",
				 "Programming"
			    ],
      "en":"Cascading Style Sheets is a style sheet language used for describing the presentation of a document written in a markup language like HTML. CSS is a cornerstone technology of the World Wide Web, alongside HTML and JavaScript.",
      "fa":"یک زبان است که برای توصیف ارائه سندی که به زبان نشانه گذاری مانند HTML نوشته شده است ، استفاده می شود. ",
      "link":[
				"https://en.wikipedia.org/wiki/Cascading_Style_Sheets",
				"https://www.computerhope.com/jargon/c/css.htm"
             ],
      "date":"2020-02-20 12:53:37 AM"
   },
   "bootstrap":{
      "title":"Bootstrap",
      "synonym":[
				 "bootstrapping",
				 "bootloader",
				 "boot-program"
			    ],
      "en":"Bootstrap is a free and open-source CSS framework directed at responsive, mobile-first front-end web development.",
      "fa":"متناوباً به عنوان برنامه bootstrapping ، bootloader یا برنامه boot گفته می شود ، یک لودر bootstrap برنامه ای است که در EPROM ، ROM یا سایر حافظه غیر فرار کامپیوتر قرار دارد.",
      "link":[
				"https://en.wikipedia.org/wiki/Bootstrap_(front-end_framework)",
				"https://www.computerhope.com/jargon/b/bootload.htm"
             ],
      "date":"2020-02-20 12:53:37 AM"
},
	"javascript":{
      "title":"javascript",
      "synonym":[
         "js",
         "es5",
         "es6",
         "livescript"
          ],
      "en":"javascript, often abbreviated as js, is an interpreted programming language that conforms to the ecmascript specification.",
      "fa":"javascript ، که به اختصار js مختصر است ، یک زبان برنامه نویسی تفسیری است که با مشخصات ecmascript مطابقت دارد.",
      "link":[
        "https://en.wikipedia.org/wiki/javascript",
        "https://www.computerhope.com/jargon/j/javascript.htm"
             ],
      "date":"2020-02-22 12:53:37 am"
   },
   "json":{
      "title":"json",
      "synonym":[
         "the-javascript-object-notation",
         "javascript"
         
          ],
      "en":"javascript object notation is an open-standard file format or data interchange format that uses human-readable text to transmit data objects consisting of attribute–value pairs and array data types.",
      "fa":"javascript object notation یک فرمت پرونده با استاندارد آزاد یا فرمت تبادل داده است که از متن قابل خواندن توسط انسان برای انتقال اشیاء داده ها متشکل از جفت ویژگی و مقدار داده های آرایه استفاده می کند.",
      "link":[
        "https://en.wikipedia.org/wiki/json",
        "https://www.computerhope.com/jargon/j/json.htm"
             ],
      "date":"2020-02-22 12:53:37 am"
   },
   "xml":{
      "title":"xml",
      "synonym":[
         "xhtml",
         "extensible-markup-language"
          ],
      "en":"extensible markup language is a markup language that defines a set of rules for encoding documents in a format that is both human-readable and machine-readable.",
      "fa":"extensionible markup language یک زبان نشانه گذاری است که مجموعه ای از قوانین را برای رمزگذاری اسناد به فرمت تعریف می کند که هم قابل خواندن توسط انسان و هم قابل خواندن با ماشین است.",
      "link":[
        "https://en.wikipedia.org/wiki/xml",
        "https://www.computerhope.com/jargon/x/xml.htm"
             ],
      "date":"2020-02-22 12:53:37 am"
   },
   "jquery":{
      "title":"Jquery",
      "synonym":[
         "JavaScript-library",
         "framework"
          ],
      "en":"jquery is a javascript library designed to simplify html dom tree traversal and manipulation, as well as event handling, css animation, and ajax. it is free, open-source software using the permissive mit license.",
      "fa":"یکی از فریم‎ورک‎های JavaScript است که امکان استفاده ازقابلیت های از پیش آماده شده ای را فراهم می‎آورد و عمل هدایت پرونده را آسان‎تر می‌کند؛ در واقع jQuery کتابخانه جاوا اسکریپت است که به کمک آن می‎توان نرم‌افزارهای مبتنی بر Ajax ، برنامه‌های سطح پایین مبادله ای (ارتباط مرورگر با کاربر) و حتی حرکات انیمیشنی با افکت‌های پیشرفته را ایجاد نمود. به کمک jQuery می‎توان صفحات وب قدرتمند و داینامیک(پویا) طراحی نمود. با توجه به اینکه جی کوئری برخی از میانبرهای نوشتاری را ارائه می‌کند اما نمی‌توان آن را جایگزین جاوا اسکریپت دانست؛ چرا که زبان اصلی نگارش کدها همان جاوا اسکریپت می‌ باشد.",
      "link":[
        "https://en.wikipedia.org/wiki/JQuery",
        "https://www.computerhope.com/jargon/j/jquery.htm"
             ],
      "date":"2020-02-22 12:53:37 am"
   },
   "angular":{
      "title":"Angular",
      "synonym":[
         "framework",
         "Web-framework"
          ],
      "en":"Angular is a TypeScript-based open-source web application framework led by the Angular Team at Google and by a community of individuals and corporations. Angular is a complete rewrite from the same team that built AngularJS.",
      "fa":" یک فریمورک ساختاری برای وب اپلیکیشن های پویا است. این فریمورک به شما اجازه میدهد تا HTML را به عنوان زبان قالب خود انتخاب کنید و سینتاکس های HTML را برای بیان صریح و واضح اجزای نرم افزار، گسترش دهید.",
      "link":[
        "https://en.wikipedia.org/wiki/Angular_(web_framework)",
        "https://angular.io/"
             ],
      "date":"2020-02-22 12:53:37 AM"
   },
   "redux":{
      "title":"Redux",
      "synonym":[
         "JavaScript-library ",
         "state"
          ],
      "en":"Redux is an open-source JavaScript library for managing application state. It is most commonly used with libraries such as React or Angular for building user interfaces.",
      "fa":"Redux یک کتابخانه جاواسکریپت است که برای ساخت رابط کاربری اپلیکیشن ها و صفحات وب استفاده می‌شود. این کتابخانه حالات (states) مختلف را در برنامه‌های جاوا اسکریپت مدیریت می‌کند",
      "link":[
        "https://en.wikipedia.org/wiki/Redux_(JavaScript_library)",
        "https://redux.js.org/"
             ],
      "date":"2020-02-22 12:53:37 AM"
   },
   "grunt":{
      "title":"Grunt",
      "synonym":[
         "Software"
          ],
      "en":"Grunt is a JavaScript task runner, a tool used to automatically perform frequent tasks such as minification, compilation, unit testing, and linting.",
      "fa":"یک بسته نرم افزاری است که با Nodejs طراحی شده است و به کمک آن می توانید یک سری وظایف (Task) در پروژه خود تعریف کنید که یک سری کارهای تکراری را به صورت اتوماتیک انجام دهد. فریمورک grunt بیش از ۵۰۰۰ پلاگین دارد و کارهایی که می تواند انجام دهد خیلی زیاد است.",
      "link":[
        "https://en.wikipedia.org/wiki/Grunt_(software)",
        "https://www.npmjs.com/package/grunt"
             ],
      "date":"2020-02-22 12:53:37 AM"
   },
   "gulp":{
      "title":"Gulp",
      "synonym":[
         "platform",
         "JavaScript"
          ],
      "en":"gulp is an open-source JavaScript toolkit created by Eric Schoffstall used as a streaming build system in front-end web development.",
      "fa":" ابزاری متن باز و رایگان بوده که توسط آقای Eric Schoffstall به زبان جاوا اسکریپت نوشته شده است. گالپ یک Build System یا Task Manager برای محیط Node.Js و پکیج منیجر npm می باشد.",
      "link":[
        "https://en.wikipedia.org/wiki/Gulp.js",
        "https://www.npmjs.com/package/gulp"
             ],
      "date":"2020-02-22 12:53:37 AM"
   },
   "php":{
      "title":"PHP",
      "synonym":[
         "php-Hypertext-Preprocessor",
         "scripting-language"
          ],
      "en":"PHP is a popular general-purpose scripting language that is especially suited to web development.",
      "fa":" یک زبان قدرتمند برای ساخت وب سایت های پویا است. این زبان اسکریپتی میتواند با HTML ادغام شود. php یک زبان در سمت سرور است, بدین معنا که کدهای php روی سرور تفسیر میشوند و خروجی html و یا خروجی های دیگری تولید میکند که توسط کاربر قابل مشاهده است.",
      "link":[
        "https://en.wikipedia.org/wiki/PHP",
        "https://www.php.net"
             ],
      "date":"2020-02-22 12:53:37 AM"
   },
   "asp":{
      "title":"ASP",
      "synonym":[
         "server-side",
         "web-application",
		 "Active-Server-Page",
         "dynamic-web"
          ],
      "en":"ASP.NET is an open-source server-side web-application framework designed for web development to produce dynamic web pages developed by Microsoft to allow programmers to build dynamic web sites, applications and services.",
      "fa":" مخفف کلمات Active Server Page که از تکنولوژی های مایکروسافت استفاده کرده و زبان اسکریبپت نویسی است که درون IIS اجرا می شود. ، PWS نسخه ای کوچک تر اما کامل IIS است.",
      "link":[
        "https://en.wikipedia.org/wiki/ASP.NET",
        "https://www.website.com/beginnerguide/designwebsite/2/5/what-is-asp?.ws"
             ],
      "date":"2020-02-22 12:53:37 AM"
   },
   "c++":{
      "title":"C++",
      "synonym":[
         "OOP",
         "object-based-programming",
         "C-With-Classes"
          ],
      "en":"C++ is a high-level, general-purpose programming language created by Bjarne Stroustrup as an extension of the C programming language",
      "fa":"یک زبان برنامه‌نویسی رایانه‌ای همه‌منظوره، همگردان، سطح میانی، شیءگرا و چندرگه (که از برنامه‌نویسی رویه‌ای، تجرید داده‌ها و برنامه‌نویسی شیءگرا پشتیبانی می‌کند)، عمومی و با قابلیت‌های سطح بالا و سطح پایین می‌باشد.",
      "link":[
        "https://en.wikipedia.org/wiki/C%2B%2B",
        "https://www.techopedia.com/definition/26184/c-programming-language"
             ],
      "date":"2020-02-22 12:53:37 AM"
   },
   "c#":{
      "title":"C#",
      "synonym":[
         "Programming-language",
         "C-Sharp"
          ],
      "en":"C# is a general-purpose, multi-paradigm programming language encompassing strong typing, lexically scoped, imperative, declarative, functional, generic, object-oriented, and component-oriented programming disciplines.",
      "fa":"یک زبان برنامه نویسی چند مدلی است که شامل دستوری ، تابعی، عمومی، شیء گرا و جزء گرا است . این زبان توسط شرکت مایکروسافت و از دل فریم ورک .NET مایکروسافت خلق و پرورش یافت و بعد ها توانست استاندارد های ISO و Ecma را دریافت کند و به‌عنوان یک زبان استاندارد تایید شود.",
      "link":[
        "https://en.wikipedia.org/wiki/C_Sharp_(programming_language)",
        "https://www.c-sharpcorner.com/article/what-is-c-sharp/"
             ],
      "date":"2020-02-22 12:53:37 AM"
   },
   "java":{
      "title":"Java",
      "synonym":[
         "jdk",
         "servlet",
         "OAK"
          ],
      "en":"Java is a general-purpose programming language that is class-based, object-oriented, and designed to have as few implementation dependencies as possible.",
      "fa":" یک زبان برنامه‌نویسیِ شیءگرا است که نخستین‌بار توسط جیمز گاسلینگ در شرکت سان‌مایکروسیستمز ایجاد گردید و در سال ۱۹۹۱ به‌عنوان بخشی از سکوی جاوا منتشر شد. زبان جاوا، شبیه به سی‌پلاس‌پلاس است، اما مدل شیءگرایی آسان‌تری دارد و از قابلیت‌های سطح پایین کمتری پشتیبانی می‌کند.",
      "link":[
        "https://en.wikipedia.org/wiki/Java_(programming_language)",
        "https://java.com/en/download/faq/whatis_java.xml"
             ],
      "date":"2020-02-22 12:53:37 AM"
   },
   "python":{
      "title":"Python",
      "synonym":[
         "open-source",
         "programming-language"
          ],
      "en":"Python is an interpreted, high-level, general-purpose programming language. Created by Guido van Rossum and first released in 1991, Python's design philosophy emphasizes code readability with its notable use of significant whitespace.",
      "fa":"هدف اصلی از ابداع زبان برنامه نویسی پایتون خوانایی بالای کد دستورهای برنامه است، بدین صورت که در IDE بلاک‌های کد به صورت خودکار ظاهر می‌شود. این زبان برنامه نویسی open source  بوده و توسط بنیاد نرم افزار پایتون مدیریت می‌شود.",
      "link":[
        "https://en.wikipedia.org/wiki/Python_(programming_language)",
        "https://www.python.org/doc/essays/blurb/"
             ],
      "date":"2020-02-22 12:53:37 AM"
   },
   "node js":{
      "title":"Node js",
      "synonym":[
         "javascript",
         "cross-platform",
         "open-source"
          ],
      "en":"Node.js is an open-source, cross-platform, JavaScript runtime environment that executes JavaScript code outside of a browser.",
      "fa":" یک پلتفرم کدنویسی سمت سرور است که بر پایه موتور جاوا اسکریپت مرورگر گوگل‌ کروم کدنویسی شده است. این پلتفرم توسط رایان داهل در سال ۲۰۰۹ ایجاد شده است و در حال حاضر آخرین نسخه آن ورژن 0.10.36 می‌باشد.",
      "link":[
        "https://en.wikipedia.org/wiki/Node.js",
        "https://www.w3schools.com/nodejs/nodejs_intro.asp"
             ],
      "date":"2020-02-22 12:53:37 AM"
   },
   "ruby":{
      "title":"Ruby",
      "synonym":[
         "ror",
         "programming-language",
         "dynamic"
          ],
      "en":"Ruby is an interpreted, high-level, general-purpose programming language. It was designed and developed in the mid-1990s by Yukihiro Matz Matsumoto in Japan. Ruby is dynamically typed and uses garbage collection.",
      "fa":"روبی یکی دیگر از زبانهای برنامه نویسی انعطاف پذیر و شی گرا می باشد .زبان روبی رسماً در روز ۲۴ فوریه ۱۹۹۳ (۵ اسفند ۱۳۷۱) توسط یوکیهیرو ماتسوموتو معرفی شد. او دنبال ساخت زبانی بود که امکانات متعادلی برای برنامه‌ نویسی تابعی و برنامه‌ نویسی دستوری برای برنامه‌ نویس فراهم آورد.",
      "link":[
        "https://en.wikipedia.org/wiki/Ruby_(programming_language)",
        "https://www.computerhope.com/jargon/r/ruby.htm"
             ],
      "date":"2020-02-22 12:53:37 AM"
   },
   "rest":{
      "title":"REST",
      "synonym":[
         "Representational",
         "software",
         "Representational-State-Transfer"
          ],
      "en":"Representational state transfer is a software architectural style that defines a set of constraints to be used for creating Web services. Web services that conform to the REST architectural style, called RESTful Web services, provide interoperability between computer systems on the Internet.",
      "fa":" يك مدل معماري براي طراحي برنامه‌هاي كاربردي شبكه است كه ترکیبی از چند مدل معماری مبتنی بر شبکه مي‌باشد و محدودیت‌هايی جهت تعریف يك واسط اتصال یکنواخت براي آن درنظر گرفته شده است.",
      "link":[
        "https://en.wikipedia.org/wiki/Representational_state_transfer",
        "https://www.codecademy.com/articles/what-is-rest"
             ],
	   "date":"2020-02-22 12:53:37 AM"
   },
   "go":{
      "title":"Go",
      "synonym":[
         "Golang",
         "programming-language"
          ],
      "en":"Go, also known as Golang, is a statically typed, compiled programming language designed at Google by Robert Griesemer, Rob Pike, and Ken Thompson. Go is syntactically similar to C, but with memory safety, garbage collection, structural typing, and CSP-style concurrency.",
      "fa":"گو یا گولینگ یک زبان برنامه نویسی، که توسط شرکت گوگل عرضه و ارائه شده است. زبان گولنگ به صورت Open Source منتشر شده تا برنامه نویس ها بتوانند آن را توسعه دهند. با استفاده از زبان برنامه نویسی Go می شود هر نوع نرم افزاری رو پیاده سازی کرد.",
      "link":[
        "https://en.wikipedia.org/wiki/Go_(programming_language)",
        "https://skywell.software/blog/what-is-go-programming-language/"
             ],
      "date":"2020-02-22 12:53:37 AM"
   },
   "sql":{
      "title":"SQL",
      "synonym":[
         "programming-language",
         "Structerd-Query-Language",
         "QL-Server"
          ],
      "en":"SQL is a domain-specific language used in programming and designed for managing data held in a relational database management system, or for stream processing in a relational data stream management system.",
      "fa":"مخفف Structerd Query Language یکی از محبوبترین زبان ها برای برنامه نویسی تحت وب در طراحی سایت می باشد.بهتر است برای طراحی سایت اس کیو ال را فرا گرفت. از SQL برای افزایش،کاهش و یا تغییر داده ها مورد استفاده قرار می گیرد.",
      "link":[
        "https://en.wikipedia.org/wiki/SQL",
        "https://www.w3schools.com/sql/sql_intro.asp"
             ],
      "date":"2020-02-22 12:53:37 AM"
   },
   "mongodb":{
      "title":"MongoDB",
      "synonym":[
         "database-program."
          ],
      "en":"MongoDB is a cross-platform document-oriented database program. Classified as a NoSQL database program, MongoDB uses JSON-like documents with schema.",
      "fa":"مونگودی‌بی یک پایگاه داده اپن سورس و رایگان مثل MySQL است با این تفاوت که عمر زیادی ندارد و مهمتر از همه بسیاری از محدودیت‌های سایر پایگاه‌های داده را ندارد!! این پایگاه داده سندگرا است بنابراین برخلاف پایگاه داده‌های رابطه‌ای، اسناد شبیه به جی‌سون را مدیریت می‌کند. ",
      "link":[
        "https://en.wikipedia.org/wiki/MongoDB",
        "https://www.guru99.com/what-is-mongodb.html"
             ],
      "date":"2020-02-22 12:53:37 AM"
   },
   "firebase":{
      "title":"Firebase",
      "synonym":[
         "Backend-as-a-Service",
         "app-development"
          ],
      "en":"Firebase is a mobile and web application development platform developed by Firebase, Inc. in 2011, then acquired by Google in 2014.",
      "fa":"فایربیس firebase یک سایت در حوزه api و سرویس جامع برای پروژه های برنامه نویسی سایت یا اپلیکیشن موبایل است وسایتی که حتی برای شما دیتابیس درست میکنه، پس از درست کردن دیتابیس به شما api فیک میده میتونی از اون api واسه هر کاری استفاده کنی.",
      "link":[
        "https://en.wikipedia.org/wiki/Firebase",
        "https://howtofirebase.com/what-is-firebase-fcb8614ba442"
             ],
      "date":"2020-02-22 12:53:37 AM"
   },
   "sass":{
      "title":"Sass",
      "synonym":[
         "style-sheet-language",
         "Syntactically-Awesome-Stylesheets",
         "SassScript"
          ],
      "en":"Sass is a style sheet language initially designed by Hampton Catlin and developed by Natalie Weizenbaum.",
      "fa":"ساس مخفف واژه (Syntactically Awesome Stylesheets) زبان سبک آبشاری است که پیش پردازنده آن CSS با متغیرها، حلقه‌ها و بسیاری از امکانات دیگر که شیوه نامه آبشاری که (CSS) به تنهایی توانایی انجام آنرا ندارد را دارا می‌باشد، ساده ایجاد CSS و نگهداری از بزرگ شیوه نامه‌های ساده‌تر ساخته شده‌اند.",
      "link":[
        "https://en.wikipedia.org/wiki/Sass_(stylesheet_language)",
        "https://www.creativebloq.com/web-design/what-is-sass-111517618"
             ],
      "date":"2020-02-22 12:53:37 AM"
   },
   "less":{
      "title":"Less",
      "synonym":[
         "client-side",
         "server-side",
         "mixin"
          ],
      "en":"Less is a dynamic preprocessor style sheet language that can be compiled into Cascading Style Sheets and run on the client side or server side.",
      "fa":" یکی از فریم‎ ورک‎ های CSS است که از قوانین CSS استفاده می‎کند؛ LESS توسط روش ‎هایی مانند متغیرها، حسابگرها، mixinها و توابع، قابلیت‎ های CSS را توسعه داده و آن را پویا ساخته است. به گونه ای که  می‎ توان کدهای لِس را در یک فایل CSS نوشت.",
      "link":[
        "https://en.wikipedia.org/wiki/Less_(stylesheet_language)",
        "https://www.javatpoint.com/what-is-less"
             ],
      "date":"2020-02-22 12:53:37 AM"
   },
   "parse":{
      "title":"Parse",
      "synonym":[
         "mobile-backend"
          ],
      "en":"Parse was a mobile backend as a service platform originally developed by the provider Parse, Inc. The company was acquired by Facebook in 2013 and shut down in January 2017",
      "fa":" Parse نیز یک دیتابیس مبتنی بر فضای ابری می باشد که به راحتی امکان ذخیره و فراخوانی داده ها و مدیا های مختلف را بدون نیاز به درگیر شدن با کدهای پیچیده فراهم می کند.",
      "link":[
        "https://en.wikipedia.org/wiki/Parse_(platform)",
        "https://www.devfright.com/parse-com/"
             ],
      "date":"2020-02-22 12:53:37 AM"
   },
   "lamp":{
      "title":"LAMP",
      "synonym":[
         "web-service-stack",
         "Linux-Apache-MySQL-PHP",
         "LAMP-Server"
          ],
      "en":"LAMP is a very common example of a web service stack, named as an acronym of the names of its original four open-source components: the Linux operating system, the Apache HTTP Server, the MySQL relational database management system, and the PHP programming language.",
      "fa":"LAMP کوتاه شده ی ۴ کلمه ی PHP ,MySQL-Server ,Apache ,Linux می باشد.این ۴ برنامه از معروف ترین برنامه های Open-Source در دنیای وب و اینترنت هستند که به Web Stack معروف اند. ",
      "link":[
        "https://en.wikipedia.org/wiki/LAMP_(software_bundle)",
        "https://www.liquidweb.com/kb/what-is-a-lamp-stack/"
             ],
      "date":"2020-02-22 12:53:37 AM"
   },
   "ruby-on-Rails":{
      "title":"Ruby-on-Rails",
      "synonym":[
         "ror",
         "Rails",
         "database"
          ],
      "en":"Ruby on Rails or Rails is a server-side web application framework written in Ruby under the MIT License. Rails is a model–view–controller framework providing default structures for a database a web service and web pages.",
      "fa":"Roby on Rails حدود سه سال پیش از پروژه‌ای با نام Basecamp که برای مدیریت پروژه‌های طراحی وب بود، حیات گرفت. RoR در واقع framework رایگان برای اپلیکیشن های تحت وب است که با هدف بهبود سرعت و سهولت کدها ایجاد شد.",
      "link":[
        "https://en.wikipedia.org/wiki/Ruby_on_Rails",
        "http://railsapps.github.io/what-is-ruby-rails.html"
             ],
      "date":"2020-02-22 12:53:37 AM"
   },
   "mean":{
      "title":"MEAN",
      "synonym":[
         "open-source",
         "JavaScript",
         "software-package"
          ],
      "en":"MEAN is a free and open-source JavaScript software stack for building dynamic web sites and web applications.",
      "fa":" یک پکیج جاوا اسکریپتی Full-stack رایگان، متن باز و کاربر پسند برای ساخت وبسایت ها و وب اپلیکیشن های داینامیک است. ",
      "link":[
        "https://en.wikipedia.org/wiki/MEAN_(solution_stack)",
        "https://www.ibm.com/cloud/learn/mean-stack-explained"
             ],
      "date":"2020-02-22 12:53:37 AM"
   },
   "django":{
      "title":"Django",
      "synonym":[
         "framework",
         "development",
         "Django-Stack"
          ],
      "en":"Django is a high-level Python Web framework that encourages rapid development and clean, pragmatic design",
      "fa":"فریم ورک Django یک چارچوب وب رایگان و متن باز است که در Python نوشته شده و از الگوی معماری MVT یا همون model-view-template پیروی می کند. هدف اصلی Django این است که ایجاد وب سایت های پیچیده و مبتنی بر پایگاه داده را آسان تر کند",
      "link":[
        "https://bitnami.com/stack/django",
        "https://en.wikipedia.org/wiki/Django_(web_framework)"
             ],
      "date":"2020-02-22 12:53:37 AM"
   },
   "apache":{
      "title":"Apache",
      "synonym":[
         "Apache-HTTP-Server",
         "HTTP",
         "Apache-HTTP-Server"
          ],
      "en":"The Apache HTTP Server, colloquially called Apache, is a free and open-source cross-platform web server software, released under the terms of Apache License 2.0. Apache is developed and maintained by an open community of developers under the auspices of the Apache Software Foundation.",
      "fa":"آپاچی (Apache) گسترده ترین و محبوب ترین سرور HTTP در دسترس بر روی اینترنت می باشد که از زبان های  PHP و Perl پشتیبانی می کند و روی بیشتر سیستم عامل های قابل اجرا است  یک برنامه free Open Source است که با سرور های وب برای اداره کردن درخواستها و تقاضاهای وب و منابع به کار می رود .",
      "link":[
        "https://en.wikipedia.org/wiki/Apache_HTTP_Server",
        "https://www.wpbeginner.com/glossary/apache/"
             ],
      "date":"2020-02-22 12:53:37 AM"
   },
   "express":{
      "title":"Express",
      "synonym":[
         "js",
         "express.js",
         "Node.js"
          ],
      "en":"Express.js, or simply Express, is a web application framework for Node.js, released as free and open-source software under the MIT License. It is designed for building web applications and APIs. It has been called the de facto standard server framework for Node.js.",
      "fa":"پلت فرم Express.js یا به طور ساده Express یک پلت فرم کاربردی وب برای Node js است که به عنوان نرم افزار آزاد و متن باز تحت مجوز MIT منتشر شده است. این چارچوب برای ساختن برنامه های کاربردی وب و API ها طراحی شده است و یک چارچوب استاندارد سرور برای Node js نامیده می شود.",
      "link":[
        "https://en.wikipedia.org/wiki/Express.js",
        "https://www.guru99.com/node-js-express.html"
             ],
      "date":"2020-02-22 12:53:37 AM"
   },
   "sqLite":{
      "title":"SQLite",
      "synonym":[
         "SQLite-Manager",
         "database",
         "SQLiteStudio"
          ],
      "en":"SQLite is a relational database management system contained in a C library. In contrast to many other database management systems, SQLite is not a client–server database engine.",
      "fa":"یکی از ابزارهای ذخیره و بازیابی اطلاعات، SQLite نام دارد. این نرم‌افزار مشهورترین سیستم ذخیره فایلی اطلاعات به شمار می‌رود. شهرت SQLite به دلیل پشتیبانی از انواع مختلف سیستم‌عامل‌ها از جمله ویندوز، لینوکس، آندروئید و مک او اس و همچنین رایگان و قدرتمند بودن آن است.",
      "link":[
        "https://en.wikipedia.org/wiki/SQLite",
        "https://www.sqlitetutorial.net/what-is-sqlite/"
             ],
      "date":"2020-02-22 12:53:37 AM"
   },"applet":{
      "title":"Applet",
      "synonym":[
         "ActiveX",
         "client side",
         "Java program"
          ],
      "en":"A small Java application that is downloaded by an ActiveX or Java-enabled web browser. Once it has been downloaded, the applet will run on the user's computer. Common applets include financial calculators and web drawing programs.",
      "fa":"یک برنامه جاوا کوچک است که توسط یک مرورگر وب ActiveX یا جاوا فعال است. پس از بارگیری ، اپلت روی رایانه کاربر اجرا می شود. اپلت های معمولی شامل ماشین حساب های مالی و برنامه های طراحی وب هستند.",
      "link":[
        "https://en.wikipedia.org/wiki/Applet",
        "https://www.javatpoint.com/java-applet"
             ],
      "date":"2020-02-22 12:53:37 AM"
   },
   "application":{
      "title":"Application",
      "synonym":[
         "software",
         "program",
         "process"
          ],
      "en":"Computer software that performs a task or set of tasks, such as word processing or drawing. Applications are also referred to as programs.",
      "fa":"نرم افزار رایانه ای که وظیفه یا مجموعه ای از کارها مانند پردازش کلمه یا طراحی را انجام می دهد. به برنامه ها نیز به عنوان برنامه گفته می شود.",
      "link":[
        "https://en.wikipedia.org/wiki/Application_software",
        "https://searchsoftwarequality.techtarget.com/definition/application"
             ],
      "date":"2020-02-22 12:53:37 AM"
   },
   "ascii":{
      "title":"ASCII",
      "synonym":[
         "American Standard Code for Information Interexchange"
          ],
      "en":"American Standard Code for Information Interchange, an encoding system for converting keyboard characters and instructions into the binary number code that the computer understands.",
      "fa":"کد استاندارد آمریكایی برای تبادل اطلاعات ، یك سیستم رمزگذار برای تبدیل كاراكترهای كیبورد و دستورالعمل ها به كد شماره دودویی است كه رایانه آن را می فهمد.",
      "link":[
        "https://en.wikipedia.org/wiki/ASCII",
        "https://www.computerhope.com/jargon/a/ascii.htm"
             ],
      "date":"2020-02-22 12:53:37 AM"
   },
   "bandwidth":{
      "title":"Bandwidth",
      "synonym":[
         "network",
         "capacity of a network"
          ],
      "en":"The capacity of a networked connection. Bandwidth determines how much data can be sent along the networked wires. Bandwidth is particularly important for Internet connections, since greater bandwidth also means faster downloads.",
      "fa":"ظرفیت اتصال به شبکه. پهنای باند تعیین می کند چه مقدار داده می تواند در امتداد سیمهای شبکه ارسال شود. پهنای باند برای اتصالات اینترنتی از اهمیت ویژه ای برخوردار است ، زیرا پهنای باند بیشتر نیز به معنی بارگیری سریع تر است.",
      "link":[
        "https://en.wikipedia.org/wiki/Bandwidth_(computing)",
        "https://searchnetworking.techtarget.com/definition/bandwidth"
             ],
      "date":"2020-02-22 12:53:37 AM"
   },
   "binary code":{
      "title":"Binary code",
      "synonym":[
         "language a computer",
         "0 and 1"
          ],
      "en":"The most basic language a computer understands, it is composed of a series of 0s and 1s. The computer interprets the code to form numbers, letters, punctuation marks, and symbols.",
      "fa":"ابتدایی ترین زبان که یک کامپیوتر آن را می فهمد ، از یک سری 0 و 1 تشکیل شده است. کامپیوتر کد را برای شکل دادن اعداد ، حروف ، علائم نگارشی و نمادها تفسیر می کند.",
      "link":[
        "https://en.wikipedia.org/wiki/Binary_code",
        "https://www.computerhope.com/jargon/b/binary.htm"
             ],
      "date":"2020-02-22 12:53:37 AM"
   },
   "bit":{
      "title":"Bit",
      "synonym":[
         "Unit of data",
         "binary digit"
          ],
      "en":"The smallest piece of computer information, either the number 0 or 1. In short they are called binary digits.",
      "fa":"کوچکترین قطعه اطلاعات رایانه ، یا عدد 0 یا 1. به طور خلاصه آنها به رقم های باینری گفته می شوند.",
      "link":[
        "https://en.wikipedia.org/wiki/Bit",
        "https://whatis.techtarget.com/definition/bit-binary-digit"
             ],
      "date":"2020-02-22 12:53:37 AM"
   },
   "boot":{
      "title":"Boot",
      "synonym":[
         "Cold boot",
         "Warm boot",
         "start up a computer"
          ],
      "en":"To start up a computer. Cold boot means restarting computer after the power is turned off. Warm boot means restarting computer without turning off the power.",
      "fa":"برای راه اندازی یک کامپیوتر. بوت سرد به معنی راه اندازی مجدد کامپیوتر پس از خاموش شدن برق است. بوت گرم به معنی راه اندازی مجدد کامپیوتر بدون خاموش کردن برق است",
      "link":[
        "https://en.wikipedia.org/wiki/Booting",
        "https://www.lifewire.com/what-does-booting-mean-2625799"
             ],
      "date":"2020-02-22 12:53:37 AM"
   },
   "browser":{
      "title":"Browser",
      "synonym":[
         "Software Internet",
         "web browser"
          ],
      "en":"Software used to navigate the Internet. Google Chrome, Firefox, Netscape Navigator and Microsoft Internet Explorer are today's most popular browsers for accessing the World Wide Web.",
      "fa":"نرم افزاری که برای حرکت در اینترنت استفاده می شود. Google Chrome ، Firefox ، Netscape Navigator و Microsoft Internet Explorer محبوب ترین مرورگرهای امروز برای دسترسی به شبکه جهانی وب هستند.",
      "link":[
        "https://en.wikipedia.org/wiki/Web_browser",
        "https://searchwindevelopment.techtarget.com/definition/browser"
             ],
      "date":"2020-02-22 12:53:37 AM"
   },
   "bug":{
      "title":"Bug",
      "synonym":[
         "error",
         "malfunction"
          ],
      "en":"A malfunction due to an error in the program or a defect in the equipment.",
      "fa":"نقص در اثر خطا در برنامه یا نقص در تجهیزات.",
      "link":[
        "https://en.wikipedia.org/wiki/Software_bug",
        "https://searchsoftwarequality.techtarget.com/definition/bug"
             ],
      "date":"2020-02-22 12:53:37 AM"
   },
   "byte":{
      "title":"Byte",
      "synonym":[
         "unit of digital information",
         "eight binary digits",
         "eight bits"
          ],
      "en":"Most computers use combinations of eight bits, called bytes, to represent one character of data or instructions. For example, the word cat has three characters, and it would be represented by three bytes.",
      "fa":"بیشتر رایانه ها از ترکیب هشت بیت به نام بایت استفاده می کنند تا یک شخصیت داده یا دستورالعمل را نشان دهند. به عنوان مثال ، کلمه گربه سه شخصیت دارد و آن را با سه بایت نشان می دهد.",
      "link":[
        "https://en.wikipedia.org/wiki/Byte",
        "https://searchstorage.techtarget.com/definition/byte"
             ],
      "date":"2020-02-22 12:53:37 AM"
   },
   "cache":{
      "title":"Cache",
      "synonym":[
         "small data-memory"
          ],
      "en":"A small data-memory storage area that a computer can use to instantly re-access data instead of re-reading the data from the original source, such as a hard drive. Browsers use a cache to store web pages so that the user may view them again without reconnecting to the Web.",
      "fa":"یک منطقه ذخیره سازی حافظه کوچک است که یک کامپیوتر می تواند از آن برای دسترسی مجدد به داده ها به جای خواندن مجدد اطلاعات از منبع اصلی ، مانند یک دیسک سخت ، استفاده کند. مرورگرها از ",
      "link":[
        "https://en.wikipedia.org/wiki/Cache_(computing)",
        "https://searchstorage.techtarget.com/definition/cache"
             ],
      "date":"2020-02-22 12:53:37 AM"
   }
   }
